Agreement.Rescind.Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" />
    <soapenv:Body xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <as:RescindAgreementRequest xmlns="http://www.saic.com/precis/2009/06/base"
            xmlns:as="http://uicds.org/AgreementService" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xsi:schemaLocation="http://uicds.org/AgreementService ../../com.saic.uicds.core.infrastructure.xmlbeans-infrastructure/src/main/xsd/services/Agreement/0.1/AgreementService.xsd ">
            <as:agreementID>1116</as:agreementID>
        </as:RescindAgreementRequest>
    </soapenv:Body>
</soapenv:Envelope>
